20211213105648-the_dirichlet_distribution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Dirichlet distribution</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">The Dirichlet distribution</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220105154404-probability_distribution.html#ID-accc4a58-2f96-42da-a43d-c8140996d0d3">Probability distribution</a></dd>
</dl>

<p>
<i>Is it to proportions what Multinomial is to number in categories?</i>
</p>

<div id="outline-container-orgc4cd974" class="outline-2">
<h2 id="orgc4cd974">Interpretation</h2>
<div class="outline-text-2" id="text-orgc4cd974">
<p>
Let us consider an urn with \(K\) different colors. There are \(\alpha_1\) balls of the first colors, &#x2026;, \(\alpha_K\) balls of the $K$th color. We draw \(N\) balls from this urn using the following protocol:
</p>

<ol class="org-ol">
<li>Pick one ball</li>
<li>Return the ball to the urn</li>
<li>Add another ball of the same color to the urn</li>
</ol>

<p>
When \(N\) is very large, the proportions of balls of different colors are distributed according to \(\operatorname{Dirichlet}(\mathbf{\alpha})\).
</p>
</div>
</div>


<div id="outline-container-org102ca46" class="outline-2">
<h2 id="org102ca46">Links to this note</h2>
</div>
</div>
</body>
</html>
